/*****************************************************************************
    System Name : Simple Analog RGB 2011
    File Name   : CRT_Ini.cpp
    Content     : 
    Version     : 0.0
    CPU board   : Arduino Duemilanove
    Compiler    : 
    History     :2011/10/21
*****************************************************************************/
/*----------------------------------------------------------------------------
;  Copyleft Nabe_RMC
;---------------------------------------------------------------------------*/
/*==========================================================================*/
/*  Includes                                                                */
/*==========================================================================*/
#define CRT_INCLUDE
#include "SYSdef.h"
#include "CRTdef.h"

/*==========================================================================*/
/*                                                                          */
/*==========================================================================*/
PROGMEM const UB CCRT::TEST1_data[ 64*3 ] = { 
#include "TestData0_63_64.h" 
#include "TestData0_63_64.h" 
#include "TestData0_63_64.h" 
};

PROGMEM const UB CCRT::AyaNuco1[ 70 * 64 ] = { 
#include "AyaNuco_7064_1.h" 
};

PROGMEM const UB CCRT::AyaNuco2[ 70 * 64 ] = { 
#include "AyaNuco_7064_2.h" 
};

PROGMEM const UB CCRT::VGA_SIN_TBL[ 256 ] = { 
#include "SIN_256_200.h"
};

/*==========================================================================*/
/*  Program                                                                 */
/*==========================================================================*/
CCRT::CCRT()	//コンストラクタの定義 宣言はCRT.defの中で行っている。
{				//オブジェクトの初期化時に自動的に呼び出される関数
				//CCRTはインスタンス化されていないのでは？
				//インスタンス化されてなければ
				//このコンストラクタは実行されない。
	
    Ini();
}

void CCRT::Ini()
{
    ChangeMode(CRT_TEST1);
}


