/*****************************************************************************
    System Name : Pinball_LCD
    File Name   : defTimer.h
    Content     : 
    Version     : 0.0
    CPU board   : Arduino Duemilanove
    Compiler    : 
    History     :2010/12/14
*****************************************************************************/
/*----------------------------------------------------------------------------
;  Copyleft Nabe_RMC
;---------------------------------------------------------------------------*/

/*==========================================================================*/
/*  DEFINE                                                                  */
/*==========================================================================*/
/*==========================================================================*/
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    Timer1
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define CRT_TCCR1A      0xC2        /* inv.,fast PWM            1100_xx10B  */
#define CRT_TCCR1A_P    0x02        /* cut OC1-normal Port out  0000_xx10B  */
#define CRT_TCCR1B      0x19        /* non divide               xx-1_1001B  */
                                    /* WGM 13 12 11 10                      */
                                    /*      1  1  1  0 - high PWM           */
#define CRT_OCR1A_HS    61          /* (1/16MHz)×61 = 3.8125us             */
#define CRT_OCR1A_VS    (507- 61)
#define CRT_ICR1        507       	/* (1/16MHz) × (507+1) = 31.75us     	*/
#define CRT_ICR1_typ_B  645   		/* H-sync:24.8kHz
									/* (1/16MHz) × (644+1) = 40.31us     	*/
/*----------------------------------------------------------------------------
■CRT表示


	
[VGA]
  ●水平同期パルス信号  周期 31.468kHz --> VGA規格 31.778us
  
  				H-Sync
  						interval   	31.778us
 						display    	25.422us   31.778us - 6.356us = 25.422us
                        pulse width	 3.813us   -++-- horizontal blanking 6.356us
                        back porch   0.636us   -+
                        front porch  1.907us   -+                                                    
                                            
           		V-Sync
           				interval   	16.683ms
           				display    	15.762ms
           				pulse width	0.0062ms
           				back porch	0.0062ms
           				front porch	0.797ms
           				

    |                       |           H-cycle ICF1 int.       31.778us


    1017(03F9H)             1017        ICR1
    0                       0
    |                       |           水平同期信号周期        31.778us
                                        水平同期信号パルス幅    4.6875us
    +    +------------------+    +--    
    |    |                  |    |
    +----+                  +----+
         
    0    75                 0    75     OCR1

                       					垂直同期間隔
                       
                                        周期                    63.625us
    +                  +----+           垂直同期時パルス幅      
    |                  |    |
    +------------------+    +-------    

    |
    *ICF1 int.

    1)OCR1 <-- OCR1buf
    2)水平ブランキング時間後からデータ送出
    3)OCR1bufに水平同期パルス時間または垂直同期切り込みパルス時間をセット
    
  ●高速PWMモード
    ・カウンタ最大値    ICR1を選択 TOP = ICR1
    ・f_pwm = fclk_IO/(N×(1+TOP ) )
        31.468kHz = 16MHz/x
        x = 16MHz/31.468kHz = 508.4
        ICR1 = TOP = 508
        f_pwm   = 16MHz/( 1×(1+508) ) = 31.434kHz (31.812us)
    ・PWM出力   反転    COM1x1～0ビット -> '11'
    ・パルス幅
        3.813us/(1/16MHz) = 61.0
        OCR1 = 61

[NTSC]
  ●水平同期パルス信号  周期 --> NTSC規格 15.734kHz -> 63.556us
  
                        front porch 1.5us   -+-- horizontal blanking 10.9us
                        sync pulse  4.7us   -+
                        back porch  4.7us   -+
                                                    63.5us - 10.9us = 52.6us
                                            

    |                       |           H-cycle ICF1 int.       63.625us


    1017(03F9H)             1017        ICR1
    0                       0
    |                       |           水平同期信号周期        63.625us
                                        水平同期信号パルス幅    4.6875us
    +    +------------------+    +--    
    |    |                  |    |
    +----+                  +----+
         
    0    75                 0    75     OCR1

                                        周期                    63.625us
    +                  +----+           垂直同期時パルス幅      
    |                  |    |
    +------------------+    +-------    

    |
    *ICF1 int.

    1)OCR1 <-- OCR1buf
    2)水平ブランキング時間後からデータ送出
    3)OCR1bufに水平同期パルス時間または垂直同期切り込みパルス時間をセット

  ●高速PWMモード
    ・カウンタ最大値    ICR1を選択 TOP = ICR1
    ・f_pwm = fclk_IO/(N×(1+TOP ) )
        15.734kHz = 16MHz/x
        x = 16MHz/15.734kHz = 1016.9
        ICR1 = TOP = 1017
        f_pwm   = 16MHz/( 1×(1+1017) ) = 15.717kHz (63.625us)
    ・PWM出力   反転    COM1x1～0ビット -> '11'
    ・パルス幅
        4.7us/(1/16MHz) = 75.2
        OCR1 = 75
----------------------------------------------------------------------------*/

