/*****************************************************************************
    System Name : Simple Analog RGB 2011
    File Name   : SYS_Ini.cpp
    Content     : 
    Version     : 0.0
    CPU board   : Arduino Duemilanove
    Compiler    : 
    History     :2011/10/22
*****************************************************************************/
/*----------------------------------------------------------------------------
;  Copyleft Nabe_RMC
;---------------------------------------------------------------------------*/
/*==========================================================================*/
/*  Includes                                                                */
/*==========================================================================*/
#define SYS_INCLUDE
#include "SYSdef.h"
#include "CRTdef.h"
#include "INTdef.h"
#include "defPort.h"

/*==========================================================================*/
/*  Program                                                                 */
/*==========================================================================*/
CINT	SobjINT;

CSYS::CSYS()	//コンストラクタの定義 宣言はSYS.defの中で行っている。
{				//オブジェクトの初期化時に自動的に呼び出される関数
				//本来は初期化子を使用して初期化する。
				//理解していないのでとりあえず代入処理で済ませる。
	f_CycleEnd = 1;

}	

void CSYS::Ini()
{
    IniPort();
    IniTimer();
    IniINT();
}

/*----------------------------------------------------------------------------
    initializing Port
----------------------------------------------------------------------------*/
void CSYS::IniPort(void)
{
    MCUCR |= OR_MCUCR;                  /* pull up disable                  */

    PORTB   &= AND_PORTB;
    DDRB    &= AND_DDRB;
    DDRB    |= OR_DDRB;
    PORTC   &= AND_PORTC;
    DDRC    |= OR_DDRC_COL_6B;
    PORTD   &= AND_PORTD;
    DDRD    &= AND_DDRD_GSC_4B;
    DDRD    |= OR_DDRD_GSC_4B;  
}

/*----------------------------------------------------------------------------
    initializing Timer
----------------------------------------------------------------------------*/
void CSYS::IniTimer(void)
{
    TCCR1A = CRT_TCCR1A;
    TCCR1B = CRT_TCCR1B;
    OCR1A  = CRT_OCR1A_HS;
	ICR1   = CRT_ICR1;
}

/*----------------------------------------------------------------------------
    initializing interrupt
----------------------------------------------------------------------------*/
void CSYS::IniINT(void){
	TIMSK1 = INI_TIMSK1;
	TIMSK0 = 0;                 /* Stop Timer0 interrupt                    */
}


/*----------------------------------------------------------------------------
    Delay 66ms
----------------------------------------------------------------------------*/
void CSYS::delay66( UB count )
{
	while( count != 0 ){
		while( SobjINT.Check66ms() == 0 ){
		}
		count--;
	}

}



